// filter(callback):
// Принимает функцию обратного вызова (callback), которая возвращает true
// или false.
// Возвращает новый массив, содержащий элементы, для которых функция обратного
// вызова вернула true.
// Используется для фильтрации элементов массива в соответствии с определенным
// условием.

// find(callback):
// Принимает функцию обратного вызова (callback), которая возвращает true или
// false.
// Возвращает первый найденный элемент массива, для которого функция обратного вызова вернула true.
// Используется для поиска первого элемента в массиве, соответствующего определенному условию.

// map(callback):
// Принимает функцию обратного вызова (callback), которая возвращает значение для каждого элемента массива.
// Возвращает новый массив, содержащий результаты вызова функции обратного вызова для каждого элемента исходного массива.
// Используется для преобразования каждого элемента массива по определенному правилу.

// forEach(callback):
// Принимает функцию обратного вызова (callback), которая выполняется для каждого элемента массива.
// Не возвращает новый массив, а просто выполняет определенное действие для каждого элемента.
// Используется для выполнения действия для каждого элемента массива без создания нового массива.

// indexOf(element):
// Принимает элемент и возвращает индекс первого вхождения этого элемента в массиве.
// Если элемент не найден, возвращает -1.
// Используется для поиска индекса элемента в массиве.

// push(element1, ..., elementN):
// Добавляет один или несколько элементов в конец массива.
// Возвращает новую длину массива.
// Используется для добавления элементов в конец массива.
