// ------ проблемы JS ------
let a = [4,5,6];
a.push(4);
console.log(a);

a = 5;
a.push(4);
console.log(a);
// ------- неявная смена типа данных в больших командах


// Для установки TS наберите в консоли:

// npm install -g typescript
// Внимание! Если вы работете на MacOS, Linux то нужно набирать команду от имени администратора (sudo).

// Проверяем версию компилятора TS:

// tsc -v
// Для запуска компиляции наберите:

// tsc
// Для запуска в режиме наблюдения:

// tsc -watch
// Остановить выполнение tsc можно командой Ctrl+C.
