/*
    Задание 1:

    Вывести в консоль с помощью цикла FOR все четные числа от 10 до 50
*/

/*
    Задание 2:

    Необходимо создать объект в котором вы опишите самого себя в формате : "свойство: значение"

    Список свойств:

    - Имя(string)
    - Фамилия(string)
    - Возраст(number)
    - Есть ли домашние животные(boolean)
*/

/*
    Задание 3:

    Отрывок из текста Котляревского, "Енеида" был разбит на небольшие кусочки и помещен в массив.
    Необходимо собрать этот текст из массива и придать ему первоначальный вид.

    Текст до разбивки на части:

    "Еней був парубок моторний, І хлопець хоть куди козак, Удавсь на всеє зле проворний,
    Завзятіший од всіх бурлак. Но греки, як спаливши Трою, Зробили з неї скирту гною."

    Массив:
    const array = [
        'Удавсь',
        'Зробили з',
        'с утра',
        'Еней був парубок моторний',
        'проворний,',
        'Завзятіший од всіх',
        'скирту гною.',
        'І хлопець хоть куди козак,',
        'на всеє зле',
        'бурлак.',
        'Но греки, як',
        'неї',
        'спаливши Трою,'
    ]

итоговый текст должен быть собран из массива array и результат записать в переменную result
*/

/*
    Задание 4:

    Напишите функцию, в теле которой будет находится следующий код:

    const fullName = `${firstName} ${lastName}`;
    console.log(fullName);

    firstName и lastName - это параметры функции

    При вызове функции передайте ей, в качестве аргумента, свое имя и фамилию.
*/

/*
    Задание 5:

    Вывести в консоль с помощью цикла WHILE все нечетные числа от 21 до 67

*/
