/* ....................................
 * /////////////DAY 1//////////////////
 * ```````````````````````````````````
 * OREZNIKOV 2021
 *
 * day 1
 * >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
 */ // Задание 1:

const city = "Kyiv";
const country = "Ukraine";

let population = 2951952;

let stadium = Boolean(true);

/* >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
 */ // Задание 2:

let   h = 40;
let   w = 70;
const d = "cm";

let res = h * w + d;

console.log(res)

/* >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
 */ // Задание 3:
